<p>Понимание частей речи и их функций поможет вам избежать ошибок. Например, вы знаете, что именно наречие, а не прилагательное определяет глагол. И также знаете, что многие наречия оканчиваются на -ly. Поэтому предложение «Она красиво поет» переведете так:
</p>
<p><strong>She sings beautifully.</strong> (<strong>Sings</strong> ― глагол, <strong>beautifully</strong> ― наречие, определяет глагол.)
</p>
<p>Неправильным будет вариант:
</p>
<p><strong>She sings beautiful.</strong> (<strong>Sings</strong> ― глагол, <strong>beautiful</strong> ― прилагательное, определяет существительное.)
</p>
<p>Все правила полны нюансов и исключений. Так, после глаголов-связок (<strong>linking verbs</strong>), наоборот, используется прилагательное, а не наречие. Глаголы-связки указывают не на действие, а на состояние, чувство, внешность:
</p>
<p>
    <strong>I feel good.</strong> ― Я чувствую себя хорошо.</p>
<p>
    <strong>You look fantastic.</strong> ― Ты великолепно выглядишь.</p>

