<h2>Артикли</h2>
<p>Что касается артиклей (<strong>articles</strong>), то раньше их относили к отдельной части речи. Сейчас же чаще относят к определителям (<b>determiners</b>) ― категории слов, которые сопровождают существительное. В английском языке есть неопределенный (indefinite) артикль <b>a/an</b> и определенный (definite) артикль <b>the</b>.
</p>
<p>Артикль ― «фишка» существительного и ставится перед ним или перед относящимся к нему прилагательным. Артикль <b>a/an</b> (форма <b>an</b> используется перед гласными звуками) может употребляться только с существительными в единственном числе.
</p>
<p>Артикли ― обширная тема грамматики английского языка, к которой относятся разные правила. Если говорить об артиклях максимально кратко, то <b>a/an</b> указывает на то, что речь идет о предмете впервые, а <b>the</b> ― на то, что предмет нам уже знаком.
</p>
<h2>Частицы</h2>
<p>Также под определение части речи не попадает частица (<stron>particle</stron>) ― неизменяемое слово, у которого есть грамматическая функция. Например, частица <b>to</b> перед глаголом указывает на то, что глагол стоит в начальной форме. Частицы входят в состав фразовых глаголов: <b>turn on, look for</b> и т. д. При этом в других контекстах <b>to, on, for</b> могут быть и предлогами:
</p>
<p><b>We went to Italy last year</b>. ― В прошлом году мы ездили в Италию
</p>
<p><b>The mug is on the table</b>. ― Кружка на столе.
</p>
<h2>Количественные местоимения</h2>
<p>В английском языке эти определители называются quantifiers. На русский их иногда переводят словом «квантификаторы» или же называют количественными местоимениями. Речь идет о таких словах, как <b>much, many, a lot (of), some, any, (a) little, (a) few</b> и некоторых других. Они указывают на количество предметов или вещества. Чтобы правильно использовать количественные местоимения, нужно понимать, исчисляемое существительное или нет, в единственном оно числе или во множественном.
</p>